wegam/STM32F1xWorkSpace/Examples/HC/PD002V30.C
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : PC001V21.c
* Author             : WOW
* Version            : V2.0.1
* Date               : 06/26/2017
* Description        : PC001V21层控制板.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

#ifdef PD002V30				//称重托盘控制器


#include "PD002V30.H"


#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"

#include "STM32_PWM.H"

#include 	"TOOL.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间

#include "stm32f10x_dma.h"






PD002V30Def MS200;

#define	I2CDataAddr		0		//I2C保存数量起始地址
//#define	I2CPageSize		8		//页大小，一页一通道，前4字节存数量，后4字节存单重
#define	GetDataRetry		20	//获取数据最大重试次数
#define	RS485RetryTime	30	//485发送等待时间--单位ms
#define	RS485RetryCount	5		//485重发次数
#define BusSize			12	//协议指令数据大小
#define Bus485Size	64
#define Command_ReadData	(unsigned char)0x05
#define Command_SendData	(unsigned char)0x06
//#define	USART_TO_RS485		//USART转485，485转USART测试

//#define PD002V30TEST

#define	MinWeightPiece	50	//最低单重AD值，低于表示标定异常

u8 RS485RxBuf[Bus485Size]={0};	//485接收缓存
u8 RS485TxBuf[Bus485Size]={0};	//485发送缓存

//u8 Bus485Rx[Bus485Size+5]={0};
//u8 Bus485Re[Bus485Size+5]={0};
//u8 Bus485Tx[Bus485Size+5]={0};

unsigned long sysledcnt=0;			//系统运行指示灯扫描计数  0.5秒

u8 txBuffer1[BusSize]={0};				//USART1-TXBF
u8 rxBuffer1[BusSize]={0};				//USART1-RXBF
u8 txBuffer_PD[BusSize]={0};			//USART1-TXBF
u8 rxBuffer_PD[BusSize]={0};			//USART1-RXBF


u8	txflg1=0;	//USART1发送标志
u8	txflg3=0;	//485BUS发送标志

u16	tx1_tcont=0;
u16	tx3_tcont=0;



u8 SwitchID=0;	//拔码开关地址

#define RS485_PD_RXEN		PA1=0				//rs485接收称重板使能
#define RS485_PD_TXEN		PA1=1				//rs485发送称重板使能

//u8	RS485_PD_txAddr=0;						//发送序号
//u8	RS485_PD_rxAddr=0;						//接收序号





u8 DebugRx[64]={0};
u8 DebugRe[64]={0};
u8 DebugTx[4096]={0};
unsigned char Num	=	0;


u32 Value_AD1=0;
u32 Value_AD2=0;

u32 Value_ADB1=0;
u32 Value_ADB2=0;

u8 swid=0;
u16 RunTime=0;
HC595_Pindef HC595_Conf;

u8 dnum1=1;
u8 dnum2=2;

u32 USTime	=	0;
u32 USTime2	=	0;
u8 	USFlag1	=	0;
u8 	USFlag2	=	0;
//sI2CDef sI2C;
unsigned char Tedata	=	0;
unsigned char Wedata	=	0;
//unsigned char Buffer[16]={0};

void TEMPdelay(u32 time);
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PD002V30_Configuration(void)
{
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H
	
	GPIO_DeInitAll();							//将所有的GPIO关闭----V20170605	
	
	GPIO_Configuration_OPP2	(GPIOC,GPIO_Pin_1);			//BUZZER//将GPIO相应管脚配置为OD(开漏)输出模式，最大速度2MHz----V20170605
	
	SwitchID_Configuration();
	
	Seg_Configuration();		//数码管接口配置
	
	SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
	
	PWM_OUT(TIM2,PWM_OUTChannel1,1,500);						//PWM设定-20161127版本
	
	CS5530_Configuration();					//CS5530初始化
	IWDG_Configuration(1000);			//独立看门狗配置---参数单位ms	
	
	PD002V30_USART_Cofiguration();
	
	AT24C02_Configuration();
	
	PWM_OUT(TIM2,PWM_OUTChannel1,8000000,500);						//PWM设定-20161127版本
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PD002V30_Server(void)
{	
	
	IWDG_Feed();		//独立看门狗喂狗
#if 0	//测试串口收发
	
	Num	=	USART_ReadBufferIDLE(USART1,DebugRx);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	if(Num)
	{
		memcpy(DebugTx,DebugRx,Num);
		USART_DMASend	(USART1,DebugTx,Num);		//串口DMA发送程序		
	}
	USART_DMASend	(USART1,DebugTx,4096);		//串口DMA发送程序
	return;
#endif	
	
	CS5530_Server();			//读取AD值

//	PD002V30_RS485_Server();
	PD002V30_USART_Server();
//	PD002V30_CMD_Server();		//命令处理
//	PD002V30_WORK_Server();		//状态处理
	
//	RunTime++;

//	
//	if(RunTime>=10)
//	{
//		dnum1++;
//		dnum2++;
//		if(dnum1>9)
//			dnum1=0;
//		if(dnum2>9)
//			dnum2=0;
//		
//		RunTime=0;
//		Seg_Server();					//数码更新接口
////		CS5530_Server();		//读取AD值

//		Wedata++;
//		if(Wedata>=0xFF)
//			Wedata	=	0;		
//	}
	
	SwitchID	=	SWITCHID_Read(&MS200.SWITCHID);		//
	
	
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AT24C02_Configuration(void)
{
	sI2CDef	*Port	=	&MS200.AT24C02.Port;
	Port->SDA_Port	=	GPIOB;
	Port->SDA_Pin	=	GPIO_Pin_7;
	
	Port->SCL_Port	=	GPIOB;
	Port->SCL_Pin	=	GPIO_Pin_6;
	
	I2C_Configuration(Port);		//启用锁--配置
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AT24C02_SaveData(void)		//保存数据,一页一通道，前4字节存数量，后4字节存单重
{
	unsigned char Buffer[16]	=	{0};
	unsigned long	QuantityBac		=	0;		//数量值
	unsigned long	WeighPieBac		=	0;		//单重
	unsigned long	QuantityNew		=	0;		//数量值
	unsigned long	WeighPieNew		=	0;		//单重
	
	sI2CDef	*I2CPort	=	&MS200.AT24C02.Port;
	
	AT24C02_ReadBuffer(I2CPort,I2CDataAddr,Buffer,16);		//获取备份数据
	
	//通道1
	QuantityNew	=	MS200.CH1SS3.Data.Quantity;				//新数量值
	WeighPieNew	=	MS200.CH1SS3.Data.WeightPiece;		//新单重值
	
	memcpy((u8*)&QuantityBac,Buffer,4);							//数量值
	memcpy((u8*)&WeighPieBac,&Buffer[4],4);					//单重值
	
	if(((QuantityBac!=QuantityNew)||(WeighPieBac!=WeighPieNew))&&(WeighPieNew!=0))	//数量和单重都有变化
	{
		memcpy(Buffer,(u8*)&QuantityNew,4);						//数量值
		memcpy(&Buffer[4],(u8*)&WeighPieNew,4);				//单重值
		AT24C02_WritePage(I2CPort,I2CDataAddr,Buffer);						//一页一通道，前4字节存数量，后4字节存单重	
	}
	
	//通道2
	QuantityNew	=	MS200.CH2SS4.Data.Quantity;		//新数量值
	WeighPieNew	=	MS200.CH2SS4.Data.WeightPiece;		//新单重值
	
	memcpy((u8*)&QuantityBac,&Buffer[8],4);			//数量值
	memcpy((u8*)&WeighPieBac,&Buffer[12],4);		//单重值
	
	if(((QuantityBac!=QuantityNew)||(WeighPieBac!=WeighPieNew))&&(WeighPieNew!=0))	//数量和单重都有变化
	{
		memcpy(&Buffer[8],(u8*)&QuantityNew,4);			//数量值
		memcpy(&Buffer[12],(u8*)&WeighPieNew,4);	//单重值
		AT24C02_WritePage(I2CPort,I2CDataAddr+8,&Buffer[8]);						//一页一通道，前4字节存数量，后4字节存单重	
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AT24C02_ReadData(void)		//读数据,一页一通道，前4字节存数量，后4字节存单重
{
	unsigned char Buffer[8]	=	{0};
	unsigned long	QuantityBac		=	0;		//数量值
	unsigned long	WeighPieBac		=	0;		//单重
	unsigned long	WeighPieNew		=	0;		//单重
	
