wegam/STM32F1xWorkSpace/Examples/HC/PD002V30.C
	sI2CDef	*I2CPort	=	&MS200.AT24C02.Port;
	
//	AT24C02_ReadBuffer(&sPD002V30.I2C.Port,I2CDataAddr,Buffer,16);		//获取备份数据
	//通道1
	WeighPieNew	=	MS200.CH1SS3.Data.WeightPiece;		//新单重值
	
	if(WeighPieNew==0)
	{
		AT24C02_ReadBuffer(I2CPort,I2CDataAddr,Buffer,8);		//获取备份数据
		memcpy((u8*)&QuantityBac,Buffer,4);			//数量值
		memcpy((u8*)&WeighPieBac,&Buffer[4],4);	//单重值
		
		if((WeighPieBac!=0xFFFFFFFF)||(WeighPieBac!=0))
		{
			MS200.CH1SS3.Data.Quantity	=	QuantityBac;		//新数量值
			MS200.CH1SS3.Data.WeightPiece	=	WeighPieBac;		//新单重值
		}
		else
		{
			//未标定
		}
	}
	//通道2
	WeighPieNew	=	MS200.CH2SS4.Data.WeightPiece;		//新单重值
	
	if(WeighPieNew==0)
	{
		AT24C02_ReadBuffer(I2CPort,I2CDataAddr+8,Buffer,8);		//获取备份数据
		memcpy((u8*)&QuantityBac,Buffer,4);			//数量值
		memcpy((u8*)&WeighPieBac,&Buffer[4],4);	//单重值
		if((WeighPieBac!=0xFFFFFFFF)||(WeighPieBac!=0))
		{
			MS200.CH2SS4.Data.Quantity		=	QuantityBac;		//新数量值
			MS200.CH2SS4.Data.WeightPiece	=	WeighPieBac;		//新单重值
		}
		else
		{
			//未标定
		}
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void SwitchID_Configuration(void)
{
	SwitchDef	*pInfo	=	&MS200.SWITCHID;
	
	pInfo->NumOfSW	=	4;
	
	pInfo->SW1_PORT	=	GPIOA;
	pInfo->SW1_Pin	=	GPIO_Pin_4;
	
	pInfo->SW2_PORT	=	GPIOA;
	pInfo->SW2_Pin	=	GPIO_Pin_5;
	
	pInfo->SW3_PORT	=	GPIOA;
	pInfo->SW3_Pin	=	GPIO_Pin_6;
	
	pInfo->SW4_PORT	=	GPIOA;
	pInfo->SW4_Pin	=	GPIO_Pin_7;
	
	SwitchIdInitialize(pInfo);							//
	
	SwitchID	=	SWITCHID_Read(pInfo);		//
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PD002V30_USART_Cofiguration(void)
{
	RS485Def	*RS485	=	&MS200.BUS485;
	RS485->USARTx	=	USART2;
	RS485->RS485_CTL_PORT	=	GPIOA;
	RS485->RS485_CTL_Pin	=	GPIO_Pin_1;
	RS485_DMA_ConfigurationNR	(RS485,19200,Bus485Size);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态	
	USART_DMA_ConfigurationNR	(USART1,115200,64);	//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PD002V30_USART_Server(void)
{
	u32 temp1=0,temp2=0;	//串口打印
	if(USTime<500)		//1秒
	{
		USTime++;
		return;
	}
	else
	{
		if(USTime2++>500)	//超时计时1秒
		{
			USFlag1	=	0;
			USFlag2	=	0;
			USTime	=	0;
			USTime2	=	0;
		}
	}
//	temp1	=	sPD002V30.ADCSS3CH1.Data.WeighFilt;
//	temp2	=	sPD002V30.ADCSS4CH2.Data.WeighFilt;
//	
//	sPD002V30.ADCSS3CH1.Data.WeighFilt	=	0xFFFFFFFF;
//	sPD002V30.ADCSS4CH2.Data.WeighFilt	=	0xFFFFFFFF;
//	temp1	=	MS200.CH1SS3.ADC.Data.WeighLive>>0;		//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值		//SS3接口，外面
//	temp2	=	MS200.CH2SS4.ADC.Data.WeighLive>>0;		//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值		//SS4接口，里面
	
	temp1	=	MS200.CH1SS3.ADC.Data.WeighLive>>0;		//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值		//SS3接口，外面
	temp2	=	MS200.CH2SS4.ADC.Data.WeighLive>>0;		//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值		//SS4接口，里面
//	if(((temp1!=0xFFFFFFFF)&&(Value_AD1!=temp1))&&((temp2!=0xFFFFFFFF)&&(Value_AD2!=temp2)))
//	{
//		Value_AD1	=	temp1;
//		Value_AD2	=	temp2;
//		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\nCH2:%0.8X\r\n",temp1>>2,temp2>>2);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
//		return;
//	}
	if((temp1!=0xFFFFFFFF)&&(Value_AD1!=temp1)&&(USFlag1==0))
	{
		Value_AD1	=	temp1;
		USFlag1	=	1;
		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\n",temp1>>2);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
		SysTick_DeleymS(20);				//SysTick延时nmS
	}
	if((temp2!=0xFFFFFFFF)&&(Value_AD2!=temp2)&&(USFlag2==0))
	{
		Value_AD2	=	temp2;
		USFlag2	=	1;
		USART_DMAPrintf	(USART1,"CH2:%0.8X\r\n",temp2>>2);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数	
		SysTick_DeleymS(20);				//SysTick延时nmS		
	}
	if((USFlag1==1)&&(USFlag2==1))
	{
		USFlag1	=	0;
		USFlag2	=	0;
		USTime	=	0;
		USTime2	=	0;
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PD002V30_RS485_Server(void)
{
	PD002V30_RS485_Recv();		//RS485接收
	PD002V30_RS485_Send();		//RS485发送
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void PD002V30_RS485_Recv(void)
{
	u8 Num	=	0;
	RS485Def	*RS485Port	=	&MS200.BUS485;
	
	MS200ProCCDef	*Ack		=	&MS200.Ack;					//485接收缓存
	PD002V30CHDef			*Channel			=	&MS200.CH1SS3;		//SS3接口，外面
	
	MS200ProCCDef	*RxBuf1	=	&Channel->RS485Rx.Pro;			//485接收缓存
	MS200ProCCDef	*RxBuf2	=	&Channel->RS485Rx.Pro;			//485接收缓存
	
	MS200ProCCDef	*BcBuf1	=	&Channel->RS485Bc.Pro;			//485接收缓存
	MS200ProCCDef	*BcBuf2	=	&Channel->RS485Bc.Pro;			//485接收缓存
	
	MS200ProCCDef	*TxBuf1	=	&Channel->RS485Tx.Pro;			//485接收缓存
	MS200ProCCDef	*TxBuf2	=	&Channel->RS485Tx.Pro;			//485接收缓存	
	
	
	Num	=	RS485_ReadBufferIDLE(RS485Port,RS485RxBuf);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(Num>=BusSize)	//接收到数据
	{
		char	*Head;
		unsigned char	Bcc8	=	0;
		MS200ProCCDef	RxPro;		//协议接收缓存
		//======查找头标识符并判断
		Head	=	strchr((char*)RS485RxBuf,head1); 			//从左向右，查找s中最左边的匹配字符位置
		if(Head)	//查找到头标识符
		{
			memcpy((u8*)&RxPro,(u8*)Head,BusSize);	//复制
		}
		else
		{
			return;
		}
		//======地址判断
		if(((RxPro.Address&0x0F)!=SwitchID)&&((RxPro.Address&0x0F)!=SwitchID+1))
		{
			return;
		}
		//======BCC校验及数据存储
		Bcc8	=	BCC8((u8*)&RxPro.SerialNumber,9);		//BCC计算
		if(RxPro.Bcc8	==	Bcc8)
		{
			//======判断是否为应答信号
			if((RxPro.Address&0x0F)==SwitchID)
			{
				if(RxPro.Receipt	==	0x0B)		//应答信号
				{
					memset(TxBuf1,0x00,BusSize);						//销毁
					return;
				}
				else
				{
					
					memcpy(RxBuf1,&RxPro,BusSize);
					memcpy(BcBuf1,&RxPro,BusSize);
				}
			}
			else
			{
				if(RxPro.Receipt	==	0x0B)		//应答信号
				{
					memset(TxBuf2,0x00,BusSize);						//销毁
					return;
				}
				else
				{
					memcpy(RxBuf2,&RxPro,BusSize);
					memcpy(BcBuf2,&RxPro,BusSize);					
				}
			}
			memcpy(Ack,&RxPro,BusSize);
			Ack->Receipt	=	0x0A;
		}
		else
		{
		}
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void PD002V30_RS485_Send(void)
{
	USARTStatusDef	Status;
	RS485Def 				RS485Info	=	MS200.BUS485;
	USART_TypeDef* 	USARTx	=	MS200.BUS485.USARTx;
	
