wegam/STM32F1xWorkSpace/Examples/HC/PD002V30.C
	MS200ProCCDef			*Ack					=	&MS200.Ack;					//485接收缓存
	PD002V30CHDef			*Channel			=	&MS200.CH1SS3;		//SS3接口，外面	
	MS200ProCCDef			*Pro					=	&Channel->RS485Rx.Pro;
	RS485ProCCDef			*TxB					=	&Channel->RS485Tx;	//485发送缓存
	RS485ProCCDef			*Rxc					=	&Channel->RS485Bc;	//485接收备份缓存
//	CS5530Def 				*ADC					=	&Channel->ADC;		//	
//	PD002V30DataDef		*Data					=	&Channel->Data;
//	WorkStateDef			*WorkState		=	&Channel->WorkState;	//工作状态
//	PD002V30CmdDef 		Cmd						=	Pro->Cmd;							//命令位	
//	unsigned char			State					=	Pro->State;						//运行状态位
	
//	unsigned long			WeightBackUp	=	Data->WeightBackUp;		//操作前备份AD值
//	unsigned long			WeightNew			=	Data->WeightNew;			//操作后新AD值
//	unsigned long			Quantity			=	Data->Quantity;				//数量
//	unsigned long			WeightPiece		=	Data->WeightPiece;		//数量
	

	if(Ack->Head.h1	== head1)
	{
		PD002V30_Pro_Packet(Ack);		//协议打包
		RS485_DMASend(&RS485Info,(u8*)Ack,BusSize);	//RS485-DMA发送程序
		memset(Ack,0x00,BusSize);		//销毁数据
	}
	else if(TxB->Pro.Head.h1	== head1)
	{
		if(TxB->Data.Time	++>RS485RetryTime)	//延时等待
		{
			TxB->Data.Time	=	0;
			TxB->Data.Retry	++;
			PD002V30_Pro_Packet(&TxB->Pro);		//协议打包
			RS485_DMASend(&RS485Info,(u8*)&TxB->Pro,BusSize);	//RS485-DMA发送程序
			if(TxB->Data.Retry>=RS485RetryCount)
			{
				TxB->Data.Time	=	0;
				TxB->Data.Retry	=	0;
				memset(&TxB->Pro,0x00,BusSize);		//销毁数据
			}
		}
		
		
	}

}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void PD002V30_Pro_Packet(MS200ProCCDef	*Pro)
{
	if(
		(Pro->Head.h1==head1)&&(Pro->Head.h2==head2)
	&&(Pro->Cmd!=0)
	&&(((Pro->Address&0x0F)==SwitchID)||((Pro->Address&0x0F)==SwitchID+1)))
	{
		Pro->Bcc8	=	BCC8(&Pro->SerialNumber,9);	//BCC计算
	}
	else
	{
		memset(Pro,0x00,BusSize);		//销毁数据
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void PD002V30_CMD_Server(void)
{
	PD002V30CHDef			*Channel			=	&MS200.CH1SS3;
	MS200ProCCDef			*Pro					=	&Channel->RS485Rx.Pro;
	MS200ProCCDef			*Rxc					=	&Channel->RS485Bc.Pro;
	
	PD002V30DataDef		*Data					=	&Channel->Data;
	WorkStateDef			*WorkState		=	&Channel->WorkState;	//工作状态
	WorkRequstDef			*WorkRequst		=	&Channel->WorkRequst;	//请求类型
	PD002V30CmdDef 		Cmd						=	Pro->Cmd;							//命令位	
	unsigned char			State					=	Pro->State;						//运行状态位
	
	unsigned long			WeightBackUp	=	Data->WeightBackUp;		//操作前备份AD值
	unsigned long			WeightNew			=	Data->WeightNew;			//操作后新AD值
	unsigned long			Quantity			=	Data->Quantity;				//数量
	unsigned long			WeightPiece		=	Data->WeightPiece;				//数量
	
	
	//命令判断:根据命令操作
	switch(Cmd)
	{
		case APP_CMD_CTCLEAR:									//0x25清零
		{
				if(State	==	0x01)								//清零第一步，响应层控板，打开抽屉
				{	
					*WorkRequst	=	RequstIdle;				/*无数据请求*/
					*WorkState	=	StateSuspend;			/*不执行采样操作*/					
				}
				else if(State	==	0x02)						//清零第二步，清空药品，关闭抽屉，记录原点AD
				{
					Rxc->State	=	0x00;
					*WorkRequst	=	RequstIdle;						/*无数据请求*/
					*WorkState	=	StateClearI2CDataReq;	/*不执行采样操作*/
				}
			}
			break;		
		case APP_CMD_CTBIAODINGS1:						//0x26称重抽屉标定步骤1:放入一定数量的药品*/
		{
				if(State	==	0x01)								//设定第一步，响应层控板，打开抽屉
				{
					*WorkRequst	=	RequstBackupData;			/*请求备份操作前AD值*/	
					*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
				}
				else if(State	==	0x02)	//设定第二步，放入药品，关闭抽屉，响应层控板
				{
					Rxc->State	=	0x00;
					*WorkRequst	=	RequstNewData;				/*请求备份操作后AD值*/	
					*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
				}
			}
				break;
		case APP_CMD_CTBIAODINGS2:						//0x27称重抽屉标定步骤2:输入数量，计算单重，保存单重--标定*/
		{
				Data->Quantity	=	Pro->Data;
				*WorkRequst	=	RequstPiece;			/*请求获取单重AD值*/	
				*WorkState	=	StateSuspend;			/*请求保存备份EEPROM数值*/
			}
				break;
		case APP_CMD_CTJIAYAO:			//0x23称重抽屉加药*/
		{
				if(State	==	0x01)			//加药第一步，更新原点值，打开抽屉
				{
					if(Data->WeightPiece==0)
					{					
						AT24C02_ReadData();		//读数据,一页一通道，前4字节存数量，后4字节存单重
						if(Data->WeightPiece==0)		//未标定
						{
							return;			//未标定
						}
						else
						{
							
							*WorkRequst	=	RequstBackupData;			/*请求备份操作前AD值*/	
							*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
						}
					}					
					else
					{
						*WorkRequst	=	RequstBackupData;			/*请求备份操作前AD值*/	
						*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
					}
				}
				else if(State	==	0x02)	//加药第二步，关闭抽屉后计算剩余数量，保存数量，上报剩余数量
				{
					*WorkRequst	=	RequstQuantity;				/*请求获取数量*/	
					*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
				}			
			}
				break;
		case APP_CMD_CTFAYAO:				//0x21称重抽屉发药*/
		{
				if(State	==	0x01)			//加药第一步，更新原点值，打开抽屉
				{
					if(Data->WeightPiece==0)
					{					
						AT24C02_ReadData();		//读数据,一页一通道，前4字节存数量，后4字节存单重
						if(Data->WeightPiece==0)		//未标定
						{
							return;			//未标定
						}
						else
						{
							*WorkRequst	=	RequstBackupData;			/*请求备份操作前AD值*/	
							*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
						}
					}
					else
					{
						*WorkRequst	=	RequstBackupData;			/*请求备份操作前AD值*/	
						*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
					}
				}
				else if(State	==	0x02)	//加药第二步，关闭抽屉后计算剩余数量，保存数量，上报剩余数量
				{
					*WorkRequst	=	RequstQuantity;				/*请求获取数量*/
					*WorkState	=	StateGetFiltDataReq;	/*请求获取滤波AD值*/
				}				
			}
		break;
		case APP_CMD_CTPANDIAN:			//0x22称重抽屉盘点*/
		{
				*WorkRequst	=	RequstQuantity;		/*请求获取数量*/
				*WorkState	=	StateSuspend;			/*不执行采样操作*/		
			}
			break;
		default:	return;
	}
	memset((char*)Pro,0x00,sizeof(MS200ProCCDef));
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void PD002V30_WORK_Server(void)
{
	PD002V30CHDef			*Channel			=	&MS200.CH1SS3;		//SS3接口，外面	
//	MS200ProCCDef			*Pro					=	&Channel->RS485Rx.Pro;
	MS200ProCCDef			*TxB					=	&Channel->RS485Tx.Pro;	//485发送缓存
	MS200ProCCDef			*Rxc					=	&Channel->RS485Bc.Pro;	//485接收备份缓存
	CS5530Def 				*ADC					=	&Channel->ADC;		//	
	PD002V30DataDef		*Data					=	&Channel->Data;
	WorkRequstDef			*WorkRequst		=	&Channel->WorkRequst;	//请求类型
	WorkStateDef			*WorkState		=	&Channel->WorkState;	//工作状态
//	PD002V30CmdDef 		Cmd						=	Pro->Cmd;							//命令位	
//	unsigned char			State					=	Pro->State;						//运行状态位
	
