wegam/STM32F1xWorkSpace/Examples/HC/PD002V30.C
	unsigned long			WeightBackUp	=	Data->WeightBackUp;		//操作前备份AD值
	unsigned long			WeightNew			=	Data->WeightNew;			//操作后新AD值
	unsigned short		Quantity			=	Data->Quantity;				//数量
	unsigned short		WeightPiece		=	Data->WeightPiece;		//单重
	//命令判断:根据命令操作
	switch(*WorkState)
	{
		case StateIdle:			/*空闲状态*/
		{
			return;
		}
		break;
		case StateSuspend:			/*空闲状态*/
		{
			memcpy(TxB,Rxc,BusSize);		//复制数据
			memset(Rxc,0x00,BusSize);		//销毁备份
			switch(*WorkRequst)
			{
				case RequstPiece :
					*WorkState	=	StateProcessDataExe;	/*执行计算*/
				break;
				default :
					*WorkState	=	StateIdle;		/*空闲状态*/
					return;

			}
		}
		break;
		case StateClearI2CDataReq:			/*请求清除备份EEPROM数值*/
		{
			//清除数据
			Data->Quantity			=	0;		//数量			
			Data->WeightPiece		=	0;		//单重
			Data->WeightBackUp	=	0;		//操作前备份AD值
			AT24C02_SaveData();					//保存数据,一页一通道，前4字节存数量，后4字节存单重
			
			memcpy(TxB,Rxc,BusSize);		//复制数据
			memset(Rxc,0x00,BusSize);		//销毁备份
			*WorkState	=	StateIdle;		/*空闲状态*/
			*WorkRequst	=	RequstIdle;		/*无数据请求*/
			return;
		}

		case StateReadI2CDataReq:		/*请求获取备份EEPROM数值*/
		{
			//清除数据
			Data->Quantity			=	0;		//数量			
			Data->WeightPiece		=	0;		//单重
			Data->WeightBackUp	=	0;		//操作前备份AD值
			AT24C02_ReadData();					//保存数据,一页一通道，前4字节存数量，后4字节存单重
			
			memcpy(TxB,Rxc,BusSize);		//复制数据
			memset(Rxc,0x00,BusSize);		//销毁备份
			*WorkState	=	StateIdle;		/*请求保存备份EEPROM数值*/
			*WorkRequst	=	RequstIdle;
			return;
		}

		case StateSaveI2CDataReq:		/*请求保存备份EEPROM数值*/
		{
			AT24C02_SaveData();					//保存数据,一页一通道，前4字节存数量，后4字节存单重
			
			memcpy(TxB,Rxc,BusSize);		//复制数据
			memset(Rxc,0x00,BusSize);		//销毁备份
			*WorkState	=	StateIdle;		/*请求保存备份EEPROM数值*/
			*WorkRequst	=	RequstIdle;
			return;
		}
		case StateGetFiltDataReq:			/*请求获取滤波AD值*/
		{
				Data->Time	=	0;
				ADC->Data.WeighFilt	=	0xFFFFFFFF;
				ADC->Data.Time	=	0;
				memset(&ADC->Data.Buffer,0xFF,DataNum);
				*WorkState	=	StateGetFiltDataWait;
			}
			break;		
		case StateGetFiltDataWait:		/*等待获取滤波AD值*/
		{	
			if(Data->Time++>=GetFiltDataDelayTime)
			{
				Data->Time	=	0;
				Data->Retry	=	0;
				*WorkState	=	StateGetFiltDataExe;
				return;
			}
			else
			{
				return;
			}
		}
		case StateGetFiltDataExe:		/*执行获取滤波AD值*/	
		{
			if(ADC->Data.WeighFilt	== 0xFFFFFFFF)		//获取稳定AD值
			{	
				if(Data->Time++>=GetFiltDataDelayTime)	//读一个AD130ms
				{
					if(Data->Retry++	>=GetDataRetry)	//重试最大值
					{
						Data->Time	=	0;
						Data->Retry	=	0;
						memset(Rxc,0x00,BusSize);		//销毁备份						
						*WorkState	=	StateIdle;		/*请求保存备份EEPROM数值*/
						return;
					}
					Data->Time	=	0;
					return;
				}
				return;
			}
			Data->Time	=	0;
			Data->Retry	=	0;	
			*WorkState	=	StateProcessDataExe;	/*执行计算*/
		}
		break;
		case StateProcessDataExe:	/*执行计算*/
		{
			*WorkState	=	StateIdle;		/*空闲状态*/					
			switch(*WorkRequst)
			{
				case RequstIdle:
						return;
				case RequstBackupData:
						Data->WeightNew			=	0;
						Data->WeightBackUp	=	ADC->Data.WeighFilt;
						*WorkRequst	=	RequstIdle;		/*无数据请求*/
				break;
				case RequstNewData:
					Data->WeightNew			=	ADC->Data.WeighFilt;
					*WorkRequst	=	RequstIdle;		/*无数据请求*/
				break;
				case RequstPiece:		//标定
					if(Data->Quantity	==0)
					{
						*WorkRequst				=	RequstIdle;		/*无数据请求*/
					}
					Data->WeightNew		=	ADC->Data.WeighFilt;
					if(Data->WeightNew	>	Data->WeightBackUp+MinWeightPiece)	//至少一支药的重量差
					{
						Data->WeightPiece	=	(Data->WeightNew-Data->WeightBackUp)/Data->Quantity;
					}
					else if(Data->WeightBackUp	>	Data->WeightNew+MinWeightPiece)
					{
						Data->WeightPiece	=	(Data->WeightBackUp-Data->WeightNew)/Data->Quantity;
					}
					if(Data->WeightPiece	<	MinWeightPiece)	//单重过小，放入药品数量不对或者未放入
					{
						//==========放入药品数量不对或者未放入
					}
					*WorkState				=	StateSaveI2CDataReq;	/*请求保存备份EEPROM数值*/
					*WorkRequst				=	RequstIdle;		/*无数据请求*/
				break;
				case RequstQuantity:	/*请求获取数量*/
					Data->WeightNew			=	ADC->Data.WeighFilt;	//获取到新AD
					Quantity						=	Data->Quantity;				//数量
					WeightPiece					=	Data->WeightPiece;		//单重
				
					if(Data->WeightPiece	<=	MinWeightPiece)	//未标定
					{
						return;
					}
					//变重
					if(Data->WeightNew	>	Data->WeightBackUp+MinWeightPiece)	//至少一支药的重量差
					{
						Data->Quantity	=	(Data->WeightNew-Data->WeightBackUp	+	Data->WeightPiece/5)/Data->WeightPiece;
						Data->Quantity	+=	Quantity;
					}
					//变轻
					else if(Data->WeightBackUp	>	Data->WeightNew+MinWeightPiece)
					{
						Data->Quantity	=	(Data->WeightBackUp	-	Data->WeightNew	+	Data->WeightPiece/5)/Data->WeightPiece;
						if(Quantity	>	Data->Quantity)
							Data->Quantity	=	Quantity	-	Data->Quantity;
						else
							Data->Quantity	=	0;
					}
					Rxc->State				=	0x00;
					Rxc->Data					=	Data->Quantity;
					*WorkState				=	StateSaveI2CDataReq;	/*请求保存备份EEPROM数值*/
					*WorkRequst				=	RequstIdle;		/*无数据请求*/
				break;
				default:break;					
			}
			memcpy(TxB,Rxc,BusSize);		//复制数据
			memset(Rxc,0x00,BusSize);		//销毁备份
			}
			break;
		default:	break;
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		: 获取拔码开关地址
* 输入			: void
* 返回值			: void
*******************************************************************************/
u8 PD002V30_GetSwitchID(void)
{
	u8 SwitchTemp=0;	

	SwitchTemp|=PA4in<<0;		//S1
	SwitchTemp|=PA5in<<1;		//S2
	SwitchTemp|=PA6in<<2;		//S3
	SwitchTemp|=PA7in<<3;		//S4
	
	SwitchTemp=~SwitchTemp;
	SwitchTemp=SwitchTemp&0x0F;
	
	return SwitchTemp;
}
/*******************************************************************************
* 函数名			:	PC001V21_GetBufferArray
* 功能描述		: 获取4个抽屉8个通道的AD值，一个一个抽屉获取
* 输入			: void
* 返回值			: void
*******************************************************************************/
u8 PD002V30_GetBufferArray(void)
{
	return 0;
}
/*******************************************************************************
* 函数名			:	
* 功能描述		: CS5530初始化
* 输入			: void
* 返回值			: void
*******************************************************************************/
void CS5530_Configuration(void)
{
	
	CS5530Def 		*CS5530	=	NULL;
	CS5530PortDef *Port		=	NULL;
	
	
	CS5530		=	&MS200.CH1SS3.ADC;
	Port			=	&CS5530->Port;
	//SS3接口，外面
	Port->CS_PORT=GPIOB;
	Port->CS_Pin=GPIO_Pin_12;
	
	Port->SDI_PORT=GPIOB;
	Port->SDI_Pin=GPIO_Pin_15;
	
