wegam/STM32F1xWorkSpace/Examples/HC/PD002V30.C
	Port->SDO_PORT=GPIOB;
	Port->SDO_Pin=GPIO_Pin_14;
	
	Port->SCLK_PORT=GPIOB;
	Port->SCLK_Pin=GPIO_Pin_13;
	
	CS5530_Initialize(CS5530);	
	
	
	//SS4接口，里面
	CS5530		=	&MS200.CH2SS4.ADC;
	Port			=	&CS5530->Port;
	
	
	Port->CS_PORT=GPIOA;
	Port->CS_Pin=GPIO_Pin_8;
	
	Port->SDI_PORT=GPIOB;
	Port->SDI_Pin=GPIO_Pin_15;
	
	Port->SDO_PORT=GPIOB;
	Port->SDO_Pin=GPIO_Pin_14;
	
	Port->SCLK_PORT=GPIOB;
	Port->SCLK_Pin=GPIO_Pin_13;	
	
	CS5530_Initialize(CS5530);
}
/*******************************************************************************
* 函数名			:	
* 功能描述		: CS5530初始化
* 输入			: void
* 返回值			: void
*******************************************************************************/
void CS5530_Server(void)
{
#if 1
	CS5530_Process(&MS200.CH1SS3.ADC);		//SS3接口，外面
//	CS5530_Process(&MS200.CH2SS4.ADC);		//SS4接口，里面
	
//	if(((CS5530_1.Data.WeighFilt	!=0xFFFFFFFF)&&(CS5530_2.Data.WeighFilt	!=0xFFFFFFFF))
//		&&((CS5530_1.Data.WeighFilt	!=0x00)&&(CS5530_2.Data.WeighFilt	!=0x00)))
//	{
//		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\nCH2:%0.8X\r\n",CS5530_1.Data.WeighFilt,CS5530_2.Data.WeighFilt);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
//		CS5530_1.Data.WeighFilt	=	0;
//		CS5530_2.Data.WeighFilt	=	0;
//	}
	return;
#endif

#if 0	
	u32 temp1=0,temp2=0;

	temp1	=	CS5530_ReadData(&MS200.CH1SS3.ADC);		//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值		//SS3接口，外面
//	temp2	=	CS5530_ReadData(&MS200.CH2SS4.ADC);		//读取AD值，如果返回0xFFFFFFFF,则未读取到24位AD值		//SS4接口，里面
	
//	temp2	=	CS5530_GetWeigh(&CS5530_1);		//获取稳定的AD值
//	temp1	=	CS5530_GetWeigh(&CS5530_2);		//获取稳定的AD值
	
//	if(temp1>Value_AD1)
//	{
//		Value_ADB1	=	temp1	-	Value_AD1;
//	}
//	else
//	{
//		Value_ADB1	=	Value_AD1	-	temp1;
//	}
//	
//	if(temp2>Value_AD2)
//	{
//		Value_ADB2	=	temp2	-	Value_AD2;
//	}
//	else
//	{
//		Value_ADB2	=	Value_AD2	-	temp2;
//	}
//	if(temp1!=0xFFFFFFFF)
//	{
////		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\n",temp1>>2);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
//	}
	if((temp1!=0xFFFFFFFF)&&(temp2!=0xFFFFFFFF))
	{
		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\nCH2:%0.8X\r\n",temp1>>0,temp2>>0);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
		return;
	}
	if(temp1!=0xFFFFFFFF)
	{
		Value_AD1	=	temp1;
		USART_DMAPrintf	(USART1,"CH1:%0.8X\r\n",temp1>>0);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
	}
	if(temp2!=0xFFFFFFFF)
	{
		Value_AD2	=	temp2;
		USART_DMAPrintf	(USART1,"CH2:%0.8X\r\n",temp2>>0);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
	}
	Value_AD1	=	temp1;
	Value_AD2	=	temp2;
#endif
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Seg_Configuration(void)			//数码管接口配置
{
	HC595_Conf.HC595_SDA_PORT=GPIOB;
	HC595_Conf.HC595_SDA_Pin=GPIO_Pin_5;
	
	HC595_Conf.HC595_SCK_PORT=GPIOB;
	HC595_Conf.HC595_SCK_Pin=GPIO_Pin_4;
	
	HC595_Conf.HC595_RCK_PORT=GPIOB;
	HC595_Conf.HC595_RCK_Pin=GPIO_Pin_3;
	HC595_PinConf(&HC595_Conf);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Seg_Server(void)			//数码更新接口
{
	HC595_RCK_HIGH(&HC595_Conf);
//	SysTick_DeleymS(50);				//SysTick延时nmS
	HC595_WriteNumberN(&HC595_Conf,dnum1);		//反向信号写入---三极管反相
	HC595_WriteNumberN(&HC595_Conf,dnum2);		//反向信号写入---三极管反相
//	SysTick_DeleymS(50);				//SysTick延时nmS
	HC595_RCK_LOW(&HC595_Conf);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void TEMPdelay(u32 time)
{
	while(time--);
}
#endif
